{
    "title" : "Slack Developer Community Code of Conduct",
    "why" : "Diversity and inclusion make our community strong. We encourage participation from the most varied and diverse backgrounds possible and want to be very clear about where we stand.",
    "encouraged_behaviour" : {
        "list" : ["Be welcoming.",
        "Be kind.",
        "Look out for each other."]
    },
    "unacceptable_behaviour" : {
        "list" : ["Conduct or speech which might be considered sexist, racist, homophobic, transphobic, ableist or otherwise discriminatory or offensive in nature.",
            "Do not use unwelcome, suggestive, derogatory or inappropriate nicknames or terms.",
            "Do not show disrespect towards others. (Jokes, innuendo, dismissive attitudes.)",
            "Intimidation or harassment (online or in-person). Please read the Citizen Code of Conduct for how we interpret harassment.",
            "Disrespect towards differences of opinion.",
            "Inappropriate attention or contact. Be aware of how your actions affect others. If it makes someone uncomfortable, stop.",
            "Not understanding the differences between constructive criticism and disparagement.",
            "Sustained disruptions.",
            "Violence, threats of violence or violent language."]
    },
    "scope" : "This code and related procedures also apply to unacceptable behavior occurring outside the scope of community activities, in all community venues— online and in-person— as well as in all one-on-one communications, and anywhere such behavior has the potential to adversely affect the safety and well-being of community members.",
    "enforcement" : "Understand that speech and actions have consequences, and unacceptable behavior will not be tolerated. If violations occur, organizers will take any action they deem appropriate for the infraction, up to and including expulsion.",
    "reporting" : {
        "how-to" : ["If you are the subject of, or witness to any violations of this Code of Conduct, please contact us by submitting a form here[LINK TO FORM]",
            "or email conduct@slack.com."]
    },
    "attribution" : "Portions derived from the Django Code of Conduct, The Citizen Code of Conduct, The Rust Code of Conduct and The Ada Initiative under a Creative Commons Attribution-ShareAlike license."
}
